Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_eeh.h
#ifndef _ISP_REG_EEH_H_INC_
#define _ISP_REG_EEH_H_INC_

#include <isp_reg.h>
#include <isp_reg_base.h>

#define EEH_CTRL_EN (EEH_REG_BASE + 0x0000)
#define EEH_NR_FILTER0 (EEH_REG_BASE + 0x0004)
#define EEH_NR_FILTER1 (EEH_REG_BASE + 0x0008)
#define EEH_NR_FILTER2 (EEH_REG_BASE + 0x000C)
#define EEH_NR_THD0 (EEH_REG_BASE + 0x0010)
#define EEH_NR_THD1 (EEH_REG_BASE + 0x0014)
#define EEH_NR_RATE0 (EEH_REG_BASE + 0x0018)
#define EEH_NR_RATE1 (EEH_REG_BASE + 0x001C)
#define EEH_NR_SLOPE (EEH_REG_BASE + 0x0020)
#define EEH_NR_RATE_SLOPE (EEH_REG_BASE + 0x0024)
#define EEH_SH_THD0 (EEH_REG_BASE + 0x0028)
#define EEH_SH_THD1 (EEH_REG_BASE + 0x002C)
#define EEH_SH_THD2 (EEH_REG_BASE + 0x0030)
#define EEH_SH_THD3 (EEH_REG_BASE + 0x0034)
#define EEH_SH_THD4 (EEH_REG_BASE + 0x0038)
#define EEH_SH_THD5 (EEH_REG_BASE + 0x003C)
#define EEH_SH_THD6 (EEH_REG_BASE + 0x0040)
#define EEH_SH_THD7 (EEH_REG_BASE + 0x0044)
#define EEH_SH_THD8 (EEH_REG_BASE + 0x0048)
#define EEH_SH_THD_OFFSET (EEH_REG_BASE + 0x004C)
#define EEH_SH_RATE0 (EEH_REG_BASE + 0x0050)
#define EEH_SH_RATE1 (EEH_REG_BASE + 0x0054)
#define EEH_SH_RATE_SLOPE (EEH_REG_BASE + 0x0058)
#define EEH_SH_RATE_X_SLOPE (EEH_REG_BASE + 0x005C)
#define EEH_NR_DIS_THD0 (EEH_REG_BASE + 0x0060)
#define EEH_NR_DIS_THD1 (EEH_REG_BASE + 0x0064)
#define EEH_NR_DIS_SLOPE (EEH_REG_BASE + 0x0068)
#define EEH_NR_DIS_MAX (EEH_REG_BASE + 0x006C)
#define EEH_SH_HOR_FILTER0 (EEH_REG_BASE + 0x0070)
#define EEH_SH_HOR_FILTER1 (EEH_REG_BASE + 0x0074)
#define EEH_SH_HOR_FILTER2 (EEH_REG_BASE + 0x0078)
#define EEH_SH_HOR_FILTER3 (EEH_REG_BASE + 0x007C)
#define EEH_SH_HOR_FILTER4 (EEH_REG_BASE + 0x0080)
#define EEH_NRSH_HOR_FILTER0 (EEH_REG_BASE + 0x0084)
#define EEH_NRSH_HOR_FILTER1 (EEH_REG_BASE + 0x0088)
#define EEH_NRSH_HOR_FILTER2 (EEH_REG_BASE + 0x008C)
#define EEH_NRSH_HOR_FILTER3 (EEH_REG_BASE + 0x0090)
#define EEH_NRSH_HOR_FILTER4 (EEH_REG_BASE + 0x0094)
#define EEH_SH_VER_FILTER0 (EEH_REG_BASE + 0x0098)
#define EEH_SH_VER_FILTER1 (EEH_REG_BASE + 0x009C)
#define EEH_SH_VER_FILTER2 (EEH_REG_BASE + 0x00A0)
#define EEH_SH_VER_FILTER3 (EEH_REG_BASE + 0x00A4)
#define EEH_SH_VER_FILTER4 (EEH_REG_BASE + 0x00A8)
#define EEH_NRSH_VER_FILTER0 (EEH_REG_BASE + 0x00AC)
#define EEH_NRSH_VER_FILTER1 (EEH_REG_BASE + 0x00B0)
#define EEH_NRSH_VER_FILTER2 (EEH_REG_BASE + 0x00B4)
#define EEH_NRSH_VER_FILTER3 (EEH_REG_BASE + 0x00B8)
#define EEH_NRSH_VER_FILTER4 (EEH_REG_BASE + 0x00BC)
#define EEH_MEAN_FILTER0 (EEH_REG_BASE + 0x00C0)
#define EEH_MEAN_FILTER1 (EEH_REG_BASE + 0x00C4)
#define EEH_LAP_FILTER (EEH_REG_BASE + 0x00C8)
#define EEH_M_TURN (EEH_REG_BASE + 0x00CC)
#define EEH_Y_INV_SUPPRESS (EEH_REG_BASE + 0x00D0)
#define EEH_INV_SHARP_RATE (EEH_REG_BASE + 0x00D4)
#define EEH_FCRD_RATE (EEH_REG_BASE + 0x00D8)
#define EEH_SH_DIS_THD0 (EEH_REG_BASE + 0x00DC)
#define EEH_SH_DIS_THD1 (EEH_REG_BASE + 0x00E0)
#define EEH_SH_DIS_SLOPE (EEH_REG_BASE + 0x00E4)
#define EEH_SH_DIS_MAX (EEH_REG_BASE + 0x00E8)
#define EEH_SYNC (EEH_REG_BASE + 0x00EC)

/* EEH_CTRL_EN 0x0000 */
#define FCRD_EN_OFFSET 0
#define FCRD_EN_BITS 1
#define FCRD_EN_MASK (((1 << 1) - 1) << 0)
#define SH_EDGE_MAP_EN_OFFSET 1
#define SH_EDGE_MAP_EN_BITS 1
#define SH_EDGE_MAP_EN_MASK (((1 << 1) - 1) << 1)
#define NR_EDGE_MAP_EN_OFFSET 2
#define NR_EDGE_MAP_EN_BITS 1
#define NR_EDGE_MAP_EN_MASK (((1 << 1) - 1) << 2)
#define EDGE_MAP_EN_OFFSET 3
#define EDGE_MAP_EN_BITS 1
#define EDGE_MAP_EN_MASK (((1 << 1) - 1) << 3)
/* EEH_NR_FILTER0 0x0004 */
#define Y_NR_FILTER0_OFFSET 0
#define Y_NR_FILTER0_BITS 12
#define Y_NR_FILTER0_MASK (((1 << 12) - 1) << 0)
#define Y_NR_FILTER1_OFFSET 16
#define Y_NR_FILTER1_BITS 12
#define Y_NR_FILTER1_MASK (((1 << 12) - 1) << 16)
/* EEH_NR_FILTER1 0x0008 */
#define Y_NR_FILTER2_OFFSET 0
#define Y_NR_FILTER2_BITS 12
#define Y_NR_FILTER2_MASK (((1 << 12) - 1) << 0)
#define Y_NR_FILTER3_OFFSET 16
#define Y_NR_FILTER3_BITS 12
#define Y_NR_FILTER3_MASK (((1 << 12) - 1) << 16)
/* EEH_NR_FILTER2 0x000C */
#define Y_NR_FILTER4_OFFSET 0
#define Y_NR_FILTER4_BITS 12
#define Y_NR_FILTER4_MASK (((1 << 12) - 1) << 0)
#define Y_NR_FILTER5_OFFSET 16
#define Y_NR_FILTER5_BITS 12
#define Y_NR_FILTER5_MASK (((1 << 12) - 1) << 16)
/* EEH_NR_THD0 0x0010 */
#define Y_NR_THD0_OFFSET 0
#define Y_NR_THD0_BITS 9
#define Y_NR_THD0_MASK (((1 << 9) - 1) << 0)
/* EEH_NR_THD1 0x0014 */
#define Y_NR_THD1_OFFSET 0
#define Y_NR_THD1_BITS 9
#define Y_NR_THD1_MASK (((1 << 9) - 1) << 0)
/* EEH_NR_RATE0 0x0018 */
#define Y_NR_RATE0_OFFSET 0
#define Y_NR_RATE0_BITS 7
#define Y_NR_RATE0_MASK (((1 << 7) - 1) << 0)
/* EEH_NR_RATE1 0x001C */
#define Y_NR_RATE1_OFFSET 0
#define Y_NR_RATE1_BITS 7
#define Y_NR_RATE1_MASK (((1 << 7) - 1) << 0)
/* EEH_NR_SLOPE 0x0020 */
#define Y_NR_SLOPE_OFFSET 0
#define Y_NR_SLOPE_BITS 10
#define Y_NR_SLOPE_MASK (((1 << 10) - 1) << 0)
/* EEH_NR_RATE_SLOPE 0x0024 */
#define Y_NR_RATE_X_SLOPE_OFFSET 0
#define Y_NR_RATE_X_SLOPE_BITS 17
#define Y_NR_RATE_X_SLOPE_MASK (((1 << 17) - 1) << 0)
/* EEH_SH_THD0 0x0028 */
#define Y_SH_THD00_OFFSET 0
#define Y_SH_THD00_BITS 9
#define Y_SH_THD00_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD1 0x002C */
#define Y_SH_THD01_OFFSET 0
#define Y_SH_THD01_BITS 9
#define Y_SH_THD01_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD2 0x0030 */
#define Y_SH_THD02_OFFSET 0
#define Y_SH_THD02_BITS 9
#define Y_SH_THD02_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD3 0x0034 */
#define Y_SH_THD03_OFFSET 0
#define Y_SH_THD03_BITS 9
#define Y_SH_THD03_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD4 0x0038 */
#define Y_SH_THD04_OFFSET 0
#define Y_SH_THD04_BITS 9
#define Y_SH_THD04_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD5 0x003C */
#define Y_SH_THD05_OFFSET 0
#define Y_SH_THD05_BITS 9
#define Y_SH_THD05_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD6 0x0040 */
#define Y_SH_THD06_OFFSET 0
#define Y_SH_THD06_BITS 9
#define Y_SH_THD06_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD7 0x0044 */
#define Y_SH_THD07_OFFSET 0
#define Y_SH_THD07_BITS 9
#define Y_SH_THD07_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD8 0x0048 */
#define Y_SH_THD08_OFFSET 0
#define Y_SH_THD08_BITS 9
#define Y_SH_THD08_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_THD_OFFSET 0x004C */
#define Y_SH_THD0_OFFSET_OFFSET 0
#define Y_SH_THD0_OFFSET_BITS 9
#define Y_SH_THD0_OFFSET_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_RATE0 0x0050 */
#define Y_SHARP_RATE0_OFFSET 0
#define Y_SHARP_RATE0_BITS 10
#define Y_SHARP_RATE0_MASK (((1 << 10) - 1) << 0)
/* EEH_SH_RATE1 0x0054 */
#define Y_SHARP_RATE1_OFFSET 0
#define Y_SHARP_RATE1_BITS 10
#define Y_SHARP_RATE1_MASK (((1 << 10) - 1) << 0)
/* EEH_SH_RATE_SLOPE 0x0058 */
#define Y_SHARP_RATE_SLOPE_OFFSET 0
#define Y_SHARP_RATE_SLOPE_BITS 11
#define Y_SHARP_RATE_SLOPE_MASK (((1 << 11) - 1) << 0)
/* EEH_SH_RATE_X_SLOPE 0x005C */
#define Y_SHARP_RATE_X_SLOPE_OFFSET 0
#define Y_SHARP_RATE_X_SLOPE_BITS 21
#define Y_SHARP_RATE_X_SLOPE_MASK (((1 << 21) - 1) << 0)
/* EEH_NR_DIS_THD0 0x0060 */
#define Y_NR_DIS_TH0_OFFSET 0
#define Y_NR_DIS_TH0_BITS 12
#define Y_NR_DIS_TH0_MASK (((1 << 12) - 1) << 0)
/* EEH_NR_DIS_THD1 0x0064 */
#define Y_NR_DIS_TH1_OFFSET 0
#define Y_NR_DIS_TH1_BITS 12
#define Y_NR_DIS_TH1_MASK (((1 << 12) - 1) << 0)
/* EEH_NR_DIS_SLOPE 0x0068 */
#define Y_NR_DIS_SLOPE_OFFSET 0
#define Y_NR_DIS_SLOPE_BITS 21
#define Y_NR_DIS_SLOPE_MASK (((1 << 21) - 1) << 0)
/* EEH_NR_DIS_MAX 0x006C */
#define Y_NR_DIS_MAX_OFFSET_OFFSET 0
#define Y_NR_DIS_MAX_OFFSET_BITS 9
#define Y_NR_DIS_MAX_OFFSET_MASK (((1 << 9) - 1) << 0)
/* EEH_SH_HOR_FILTER0 0x0070 */
#define Y_SHARP_FILTER_HOR0_OFFSET 0
#define Y_SHARP_FILTER_HOR0_BITS 13
#define Y_SHARP_FILTER_HOR0_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_HOR1_OFFSET 16
#define Y_SHARP_FILTER_HOR1_BITS 13
#define Y_SHARP_FILTER_HOR1_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_HOR_FILTER1 0x0074 */
#define Y_SHARP_FILTER_HOR2_OFFSET 0
#define Y_SHARP_FILTER_HOR2_BITS 13
#define Y_SHARP_FILTER_HOR2_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_HOR3_OFFSET 16
#define Y_SHARP_FILTER_HOR3_BITS 13
#define Y_SHARP_FILTER_HOR3_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_HOR_FILTER2 0x0078 */
#define Y_SHARP_FILTER_HOR4_OFFSET 0
#define Y_SHARP_FILTER_HOR4_BITS 13
#define Y_SHARP_FILTER_HOR4_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_HOR5_OFFSET 16
#define Y_SHARP_FILTER_HOR5_BITS 13
#define Y_SHARP_FILTER_HOR5_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_HOR_FILTER3 0x007C */
#define Y_SHARP_FILTER_HOR6_OFFSET 0
#define Y_SHARP_FILTER_HOR6_BITS 13
#define Y_SHARP_FILTER_HOR6_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_HOR7_OFFSET 16
#define Y_SHARP_FILTER_HOR7_BITS 13
#define Y_SHARP_FILTER_HOR7_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_HOR_FILTER4 0x0080 */
#define Y_SHARP_FILTER_HOR8_OFFSET 0
#define Y_SHARP_FILTER_HOR8_BITS 13
#define Y_SHARP_FILTER_HOR8_MASK (((1 << 13) - 1) << 0)
/* EEH_NRSH_HOR_FILTER0 0x0084 */
#define Y_NRSHARP_FILTER_HOR0_OFFSET 0
#define Y_NRSHARP_FILTER_HOR0_BITS 13
#define Y_NRSHARP_FILTER_HOR0_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_HOR1_OFFSET 16
#define Y_NRSHARP_FILTER_HOR1_BITS 13
#define Y_NRSHARP_FILTER_HOR1_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_HOR_FILTER1 0x0088 */
#define Y_NRSHARP_FILTER_HOR2_OFFSET 0
#define Y_NRSHARP_FILTER_HOR2_BITS 13
#define Y_NRSHARP_FILTER_HOR2_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_HOR3_OFFSET 16
#define Y_NRSHARP_FILTER_HOR3_BITS 13
#define Y_NRSHARP_FILTER_HOR3_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_HOR_FILTER2 0x008C */
#define Y_NRSHARP_FILTER_HOR4_OFFSET 0
#define Y_NRSHARP_FILTER_HOR4_BITS 13
#define Y_NRSHARP_FILTER_HOR4_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_HOR5_OFFSET 16
#define Y_NRSHARP_FILTER_HOR5_BITS 13
#define Y_NRSHARP_FILTER_HOR5_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_HOR_FILTER3 0x0090 */
#define Y_NRSHARP_FILTER_HOR6_OFFSET 0
#define Y_NRSHARP_FILTER_HOR6_BITS 13
#define Y_NRSHARP_FILTER_HOR6_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_HOR7_OFFSET 16
#define Y_NRSHARP_FILTER_HOR7_BITS 13
#define Y_NRSHARP_FILTER_HOR7_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_HOR_FILTER4 0x0094 */
#define Y_NRSHARP_FILTER_HOR8_OFFSET 0
#define Y_NRSHARP_FILTER_HOR8_BITS 13
#define Y_NRSHARP_FILTER_HOR8_MASK (((1 << 13) - 1) << 0)
/* EEH_SH_VER_FILTER0 0x0098 */
#define Y_SHARP_FILTER_VER0_OFFSET 0
#define Y_SHARP_FILTER_VER0_BITS 13
#define Y_SHARP_FILTER_VER0_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_VER1_OFFSET 16
#define Y_SHARP_FILTER_VER1_BITS 13
#define Y_SHARP_FILTER_VER1_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_VER_FILTER1 0x009C */
#define Y_SHARP_FILTER_VER2_OFFSET 0
#define Y_SHARP_FILTER_VER2_BITS 13
#define Y_SHARP_FILTER_VER2_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_VER3_OFFSET 16
#define Y_SHARP_FILTER_VER3_BITS 13
#define Y_SHARP_FILTER_VER3_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_VER_FILTER2 0x00A0 */
#define Y_SHARP_FILTER_VER4_OFFSET 0
#define Y_SHARP_FILTER_VER4_BITS 13
#define Y_SHARP_FILTER_VER4_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_VER5_OFFSET 16
#define Y_SHARP_FILTER_VER5_BITS 13
#define Y_SHARP_FILTER_VER5_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_VER_FILTER3 0x00A4 */
#define Y_SHARP_FILTER_VER6_OFFSET 0
#define Y_SHARP_FILTER_VER6_BITS 13
#define Y_SHARP_FILTER_VER6_MASK (((1 << 13) - 1) << 0)
#define Y_SHARP_FILTER_VER7_OFFSET 16
#define Y_SHARP_FILTER_VER7_BITS 13
#define Y_SHARP_FILTER_VER7_MASK (((1 << 13) - 1) << 16)
/* EEH_SH_VER_FILTER4 0x00A8 */
#define Y_SHARP_FILTER_VER8_OFFSET 0
#define Y_SHARP_FILTER_VER8_BITS 13
#define Y_SHARP_FILTER_VER8_MASK (((1 << 13) - 1) << 0)
/* EEH_NRSH_VER_FILTER0 0x00AC */
#define Y_NRSHARP_FILTER_VER0_OFFSET 0
#define Y_NRSHARP_FILTER_VER0_BITS 13
#define Y_NRSHARP_FILTER_VER0_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_VER1_OFFSET 16
#define Y_NRSHARP_FILTER_VER1_BITS 13
#define Y_NRSHARP_FILTER_VER1_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_VER_FILTER1 0x00B0 */
#define Y_NRSHARP_FILTER_VER2_OFFSET 0
#define Y_NRSHARP_FILTER_VER2_BITS 13
#define Y_NRSHARP_FILTER_VER2_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_VER3_OFFSET 16
#define Y_NRSHARP_FILTER_VER3_BITS 13
#define Y_NRSHARP_FILTER_VER3_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_VER_FILTER2 0x00B4 */
#define Y_NRSHARP_FILTER_VER4_OFFSET 0
#define Y_NRSHARP_FILTER_VER4_BITS 13
#define Y_NRSHARP_FILTER_VER4_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_VER5_OFFSET 16
#define Y_NRSHARP_FILTER_VER5_BITS 13
#define Y_NRSHARP_FILTER_VER5_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_VER_FILTER3 0x00B8 */
#define Y_NRSHARP_FILTER_VER6_OFFSET 0
#define Y_NRSHARP_FILTER_VER6_BITS 13
#define Y_NRSHARP_FILTER_VER6_MASK (((1 << 13) - 1) << 0)
#define Y_NRSHARP_FILTER_VER7_OFFSET 16
#define Y_NRSHARP_FILTER_VER7_BITS 13
#define Y_NRSHARP_FILTER_VER7_MASK (((1 << 13) - 1) << 16)
/* EEH_NRSH_VER_FILTER4 0x00BC */
#define Y_NRSHARP_FILTER_VER8_OFFSET 0
#define Y_NRSHARP_FILTER_VER8_BITS 13
#define Y_NRSHARP_FILTER_VER8_MASK (((1 << 13) - 1) << 0)
/* EEH_MEAN_FILTER0 0x00C0 */
#define Y_MEAN_FILTER0_OFFSET 0
#define Y_MEAN_FILTER0_BITS 9
#define Y_MEAN_FILTER0_MASK (((1 << 9) - 1) << 0)
#define Y_MEAN_FILTER1_OFFSET 16
#define Y_MEAN_FILTER1_BITS 9
#define Y_MEAN_FILTER1_MASK (((1 << 9) - 1) << 16)
/* EEH_MEAN_FILTER1 0x00C4 */
#define Y_MEAN_FILTER2_OFFSET 0
#define Y_MEAN_FILTER2_BITS 9
#define Y_MEAN_FILTER2_MASK (((1 << 9) - 1) << 0)
/* EEH_LAP_FILTER 0x00C8 */
#define Y_LAP_FILTER0_OFFSET 0
#define Y_LAP_FILTER0_BITS 8
#define Y_LAP_FILTER0_MASK (((1 << 8) - 1) << 0)
#define Y_LAP_FILTER1_OFFSET 8
#define Y_LAP_FILTER1_BITS 8
#define Y_LAP_FILTER1_MASK (((1 << 8) - 1) << 8)
#define Y_LAP_FILTER2_OFFSET 16
#define Y_LAP_FILTER2_BITS 8
#define Y_LAP_FILTER2_MASK (((1 << 8) - 1) << 16)
/* EEH_M_TURN 0x00CC */
#define Y_M_TURN_OFFSET 0
#define Y_M_TURN_BITS 10
#define Y_M_TURN_MASK (((1 << 10) - 1) << 0)
/* EEH_Y_INV_SUPPRESS 0x00D0 */
#define Y_INV_SUPPRESS_OFFSET 0
#define Y_INV_SUPPRESS_BITS 15
#define Y_INV_SUPPRESS_MASK (((1 << 15) - 1) << 0)
/* EEH_INV_SHARP_RATE 0x00D4 */
#define INV_Y_SHARP_RATE1_OFFSET 0
#define INV_Y_SHARP_RATE1_BITS 15
#define INV_Y_SHARP_RATE1_MASK (((1 << 15) - 1) << 0)
/* EEH_FCRD_RATE 0x00D8 */
#define FCRD_RATE_OFFSET 0
#define FCRD_RATE_BITS 5
#define FCRD_RATE_MASK (((1 << 5) - 1) << 0)
/* EEH_SH_DIS_THD0 0x00DC */
#define Y_SH_DIS_TH0_OFFSET 0
#define Y_SH_DIS_TH0_BITS 12
#define Y_SH_DIS_TH0_MASK (((1 << 12) - 1) << 0)
/* EEH_SH_DIS_THD1 0x00E0 */
#define Y_SH_DIS_TH1_OFFSET 0
#define Y_SH_DIS_TH1_BITS 12
#define Y_SH_DIS_TH1_MASK (((1 << 12) - 1) << 0)
/* EEH_SH_DIS_SLOPE 0x00E4 */
#define Y_SH_DIS_SLOPE_OFFSET 0
#define Y_SH_DIS_SLOPE_BITS 21
#define Y_SH_DIS_SLOPE_MASK (((1 << 21) - 1) << 0)
/* EEH_SH_DIS_MAX 0x00E8 */
#define Y_SH_DIS_MAX_OFFSET_OFFSET 0
#define Y_SH_DIS_MAX_OFFSET_BITS 9
#define Y_SH_DIS_MAX_OFFSET_MASK (((1 << 9) - 1) << 0)
/* EEH_SYNC 0x00EC */
#define EEH_SYNC_OFFSET 0
#define EEH_SYNC_BITS 1
#define EEH_SYNC_MASK (((1 << 1) - 1) << 0)

#endif /* _ISP_REG_EEH_H_INC_ */

